{
    "stoi": {
        "!": 0,
        ",": 1,
        ".": 2,
        "?": 3,
        "a": 4,
        "ai": 5,
        "assist": 6,
        "assistant": 7,
        "biết": 8,
        "biệt": 9,
        "buổi": 10,
        "bye": 11,
        "bạn": 12,
        "bận": 13,
        "bữa": 14,
        "can": 15,
        "chiều": 16,
        "cho": 17,
        "chuyện": 18,
        "chào": 19,
        "chí": 20,
        "chúc": 21,
        "chúng": 22,
        "chút": 23,
        "chưa": 24,
        "chờ": 25,
        "chứ": 26,
        "cuối": 27,
        "câu": 28,
        "còn": 29,
        "có": 30,
        "cùng": 31,
        "cũng": 32,
        "cảm": 33,
        "cần": 34,
        "của": 35,
        "cứ": 36,
        "day": 37,
        "dành": 38,
        "dùng": 39,
        "dạo": 40,
        "dậy": 41,
        "friend": 42,
        "gian": 43,
        "giãn": 44,
        "giúp": 45,
        "giấc": 46,
        "good": 47,
        "great": 48,
        "gì": 49,
        "gặp": 50,
        "gọi": 51,
        "have": 52,
        "hello": 53,
        "hey": 54,
        "hi": 55,
        "hiệu": 56,
        "how": 57,
        "hoạt": 58,
        "huấn": 59,
        "hân": 60,
        "hình": 61,
        "hôm": 62,
        "hạnh": 63,
        "hẹn": 64,
        "hỏi": 65,
        "hỗ": 66,
        "i": 67,
        "it's": 68,
        "khi": 69,
        "không": 70,
        "khỏe": 71,
        "kết": 72,
        "kỳ": 73,
        "later": 74,
        "luyện": 75,
        "luôn": 76,
        "là": 77,
        "làm": 78,
        "lành": 79,
        "lâu": 80,
        "lý": 81,
        "lượng": 82,
        "lại": 83,
        "lần": 84,
        "lắng": 85,
        "lợi": 86,
        "meet": 87,
        "mong": 88,
        "morning": 89,
        "muốn": 90,
        "mô": 91,
        "mơ": 92,
        "mạnh": 93,
        "mến": 94,
        "mọi": 95,
        "một": 96,
        "mới": 97,
        "mừng": 98,
        "nay": 99,
        "nghe": 100,
        "nghỉ": 101,
        "ngon": 102,
        "ngày": 103,
        "ngôn": 104,
        "ngơi": 105,
        "người": 106,
        "ngủ": 107,
        "ngữ": 108,
        "nhiên": 109,
        "nhiều": 110,
        "nhân": 111,
        "nhé": 112,
        "nhất": 113,
        "những": 114,
        "nice": 115,
        "nào": 116,
        "này": 117,
        "nên": 118,
        "năng": 119,
        "nối": 120,
        "phục": 121,
        "quan": 122,
        "quay": 123,
        "quen": 124,
        "quả": 125,
        "rất": 126,
        "rồi": 127,
        "rộn": 128,
        "sao": 129,
        "sau": 130,
        "see": 131,
        "sàng": 132,
        "sáng": 133,
        "sẵn": 134,
        "sẽ": 135,
        "sớm": 136,
        "sự": 137,
        "ta": 138,
        "there": 139,
        "thuận": 140,
        "thân": 141,
        "thì": 142,
        "thôi": 143,
        "thú": 144,
        "thư": 145,
        "thấy": 146,
        "thật": 147,
        "thế": 148,
        "thể": 149,
        "thời": 150,
        "thứ": 151,
        "thực": 152,
        "tiếp": 153,
        "to": 154,
        "today": 155,
        "too": 156,
        "trí": 157,
        "trò": 158,
        "trưa": 159,
        "trợ": 160,
        "tuyệt": 161,
        "tuần": 162,
        "tuệ": 163,
        "tâm": 164,
        "tên": 165,
        "tôi": 166,
        "tạm": 167,
        "tạo": 168,
        "tối": 169,
        "tốt": 170,
        "tới": 171,
        "tục": 172,
        "tự": 173,
        "việc": 174,
        "vui": 175,
        "và": 176,
        "vì": 177,
        "vấn": 178,
        "vẫn": 179,
        "vậy": 180,
        "vẻ": 181,
        "về": 182,
        "vị": 183,
        "với": 184,
        "vời": 185,
        "vụ": 186,
        "wonderful": 187,
        "xin": 188,
        "you": 189,
        "à": 190,
        "áp": 191,
        "ê": 192,
        "đang": 193,
        "đi": 194,
        "điều": 195,
        "đây": 196,
        "đã": 197,
        "đó": 198,
        "đúng": 199,
        "được": 200,
        "đấy": 201,
        "đầy": 202,
        "đặt": 203,
        "đẹp": 204,
        "đề": 205,
        "để": 206,
        "đồng": 207,
        "động": 208,
        "đỡ": 209,
        "ơi": 210,
        "ơn": 211,
        "ạ": 212,
        "ảo": 213,
        "ấm": 214,
        "ở": 215,
        "<PAD>": 216,
        "<EOS>": 217
    },
    "itos": {
        "0": "!",
        "1": ",",
        "2": ".",
        "3": "?",
        "4": "a",
        "5": "ai",
        "6": "assist",
        "7": "assistant",
        "8": "biết",
        "9": "biệt",
        "10": "buổi",
        "11": "bye",
        "12": "bạn",
        "13": "bận",
        "14": "bữa",
        "15": "can",
        "16": "chiều",
        "17": "cho",
        "18": "chuyện",
        "19": "chào",
        "20": "chí",
        "21": "chúc",
        "22": "chúng",
        "23": "chút",
        "24": "chưa",
        "25": "chờ",
        "26": "chứ",
        "27": "cuối",
        "28": "câu",
        "29": "còn",
        "30": "có",
        "31": "cùng",
        "32": "cũng",
        "33": "cảm",
        "34": "cần",
        "35": "của",
        "36": "cứ",
        "37": "day",
        "38": "dành",
        "39": "dùng",
        "40": "dạo",
        "41": "dậy",
        "42": "friend",
        "43": "gian",
        "44": "giãn",
        "45": "giúp",
        "46": "giấc",
        "47": "good",
        "48": "great",
        "49": "gì",
        "50": "gặp",
        "51": "gọi",
        "52": "have",
        "53": "hello",
        "54": "hey",
        "55": "hi",
        "56": "hiệu",
        "57": "how",
        "58": "hoạt",
        "59": "huấn",
        "60": "hân",
        "61": "hình",
        "62": "hôm",
        "63": "hạnh",
        "64": "hẹn",
        "65": "hỏi",
        "66": "hỗ",
        "67": "i",
        "68": "it's",
        "69": "khi",
        "70": "không",
        "71": "khỏe",
        "72": "kết",
        "73": "kỳ",
        "74": "later",
        "75": "luyện",
        "76": "luôn",
        "77": "là",
        "78": "làm",
        "79": "lành",
        "80": "lâu",
        "81": "lý",
        "82": "lượng",
        "83": "lại",
        "84": "lần",
        "85": "lắng",
        "86": "lợi",
        "87": "meet",
        "88": "mong",
        "89": "morning",
        "90": "muốn",
        "91": "mô",
        "92": "mơ",
        "93": "mạnh",
        "94": "mến",
        "95": "mọi",
        "96": "một",
        "97": "mới",
        "98": "mừng",
        "99": "nay",
        "100": "nghe",
        "101": "nghỉ",
        "102": "ngon",
        "103": "ngày",
        "104": "ngôn",
        "105": "ngơi",
        "106": "người",
        "107": "ngủ",
        "108": "ngữ",
        "109": "nhiên",
        "110": "nhiều",
        "111": "nhân",
        "112": "nhé",
        "113": "nhất",
        "114": "những",
        "115": "nice",
        "116": "nào",
        "117": "này",
        "118": "nên",
        "119": "năng",
        "120": "nối",
        "121": "phục",
        "122": "quan",
        "123": "quay",
        "124": "quen",
        "125": "quả",
        "126": "rất",
        "127": "rồi",
        "128": "rộn",
        "129": "sao",
        "130": "sau",
        "131": "see",
        "132": "sàng",
        "133": "sáng",
        "134": "sẵn",
        "135": "sẽ",
        "136": "sớm",
        "137": "sự",
        "138": "ta",
        "139": "there",
        "140": "thuận",
        "141": "thân",
        "142": "thì",
        "143": "thôi",
        "144": "thú",
        "145": "thư",
        "146": "thấy",
        "147": "thật",
        "148": "thế",
        "149": "thể",
        "150": "thời",
        "151": "thứ",
        "152": "thực",
        "153": "tiếp",
        "154": "to",
        "155": "today",
        "156": "too",
        "157": "trí",
        "158": "trò",
        "159": "trưa",
        "160": "trợ",
        "161": "tuyệt",
        "162": "tuần",
        "163": "tuệ",
        "164": "tâm",
        "165": "tên",
        "166": "tôi",
        "167": "tạm",
        "168": "tạo",
        "169": "tối",
        "170": "tốt",
        "171": "tới",
        "172": "tục",
        "173": "tự",
        "174": "việc",
        "175": "vui",
        "176": "và",
        "177": "vì",
        "178": "vấn",
        "179": "vẫn",
        "180": "vậy",
        "181": "vẻ",
        "182": "về",
        "183": "vị",
        "184": "với",
        "185": "vời",
        "186": "vụ",
        "187": "wonderful",
        "188": "xin",
        "189": "you",
        "190": "à",
        "191": "áp",
        "192": "ê",
        "193": "đang",
        "194": "đi",
        "195": "điều",
        "196": "đây",
        "197": "đã",
        "198": "đó",
        "199": "đúng",
        "200": "được",
        "201": "đấy",
        "202": "đầy",
        "203": "đặt",
        "204": "đẹp",
        "205": "đề",
        "206": "để",
        "207": "đồng",
        "208": "động",
        "209": "đỡ",
        "210": "ơi",
        "211": "ơn",
        "212": "ạ",
        "213": "ảo",
        "214": "ấm",
        "215": "ở",
        "216": "<PAD>",
        "217": "<EOS>"
    },
    "model_config": {
        "block_size": 32,
        "n_embd": 64,
        "n_head": 4,
        "n_layer": 4,
        "dropout": 0.2
    },
    "best_loss": 0.10386700289590019
}